<a href="https://colab.research.google.com/github/aqilaazza/mini-bootcamp-data-analyst-python/blob/main/01-basic-python/series.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Series

adalah struktur data satu dimenasi yang mirip dengan array di NumPy, namun lebih kaya dilengkapi dengan indeks. Setiap elemen dalam series memiliki label(indeks) yang memungkinkan akses data dengan label tersebut

In [1]:
import pandas as pd

In [3]:
pd.__version__

'2.2.2'

#Membuat Series

In [5]:
pd.Series?

Dari List

In [7]:
data =[10, 20, 30, 40] # tipe data integer
pd.Series(data)

0    10
1    20
2    30
3    40
dtype: int64

In [8]:
hewan = ['kucing', 'anjing', 'macam', 'ayam'] #tipe data string
pd.Series(hewan)

0    kucing
1    anjing
2     macam
3      ayam
dtype: object

In [10]:
data = ['a', 1, 'b', 2] # tipe data berbeda
pd.Series(data)

0    a
1    1
2    b
3    2
dtype: object

In [11]:
data = ([1, 2], [3, 4]) #dengan array list
pd.Series(data)

0    [1, 2]
1    [3, 4]
dtype: object

In [13]:
data = [print, len] #dengan fungsi
pd.Series(data)

0    <built-in function print>
1      <built-in function len>
dtype: object

Dari Dictionary

In [15]:
kendaraam = {
    'motor': 'Beat',
    'mobil': 'Pajero',
    'Pesawat': 'Airbus'
    }
pd.Series(kendaraam)

motor        Beat
mobil      Pajero
Pesawat    Airbus
dtype: object

Dari Array

In [17]:
import numpy as np #menggunakan array dari numpy

In [19]:
arr = np.array([1, 2, 3, 4])
pd.Series(arr)

0    1
1    2
2    3
3    4
dtype: int64

# Indexing dan Silicing

In [21]:
import pandas as pd
import numpy as np

In [20]:
arr = np.array([10, 20, 30, 40])
ser = pd.Series(arr)
ser

0    10
1    20
2    30
3    40
dtype: int64

In [24]:
presidents_indonesia = {
    'pertama': 'Soekarno',
    'kedua': 'Soeharto',
    'ketiga': 'Habibie',
    'keempat': 'Gusdur',
    'kelima': 'Megawati',
    'keenam': 'Susilo Bambang Yudhoyono',
    'ketujuh' : 'Jokowi'
}
ser_presiden = pd.Series(presidents_indonesia)
ser_presiden

pertama                    Soekarno
kedua                      Soeharto
ketiga                      Habibie
keempat                      Gusdur
kelima                     Megawati
keenam     Susilo Bambang Yudhoyono
ketujuh                      Jokowi
dtype: object

Indexing

In [22]:
ser[0]

np.int64(10)

In [23]:
ser[2]

np.int64(30)

In [25]:
ser_presiden['ketiga']

'Habibie'

Slicing

In [26]:
ser[0:3] #dimulai dari index ke 0 hingga 2

0    10
1    20
2    30
dtype: int64

In [27]:
ser_presiden['keempat' :] #dimulai presiden dengan objek keempat hingga selesai (dikosongkan)

keempat                      Gusdur
kelima                     Megawati
keenam     Susilo Bambang Yudhoyono
ketujuh                      Jokowi
dtype: object

#Operasi dan Fungsi pada Series

In [28]:
import pandas as pd
import numpy as np

In [30]:
ser_1 = pd.Series([1,2,3,4])
ser_2 = pd.Series([5,6,7,8])

Operasi Matematika

In [31]:
ser_1 + ser_2

0     6
1     8
2    10
3    12
dtype: int64

In [32]:
ser_1 * ser_2

0     5
1    12
2    21
3    32
dtype: int64

Fungsi/Methode/Attribut

In [33]:
ser_1.shape

(4,)

In [34]:
ser_1.dtype

dtype('int64')

In [35]:
ser_1.mean()

np.float64(2.5)

In [36]:
ser_1.max()

4